CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34CREATE DATABASE  IF NOT EXISTS `sdutoa` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `sdutoa`;
-- MySQL dump 10.13  Distrib 5.6.28, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: sdutoa
-- ------------------------------------------------------
-- Server version	5.6.28-0ubuntu0.15.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jsj_awards`
--

DROP TABLE IF EXISTS `jsj_awards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_awards` (
  `aid` bigint(20) NOT NULL AUTO_INCREMENT,
  `competitionid` int(11) DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `grade` int(11) DEFAULT NULL,
  `deptid` int(11) DEFAULT NULL,
  `achievement` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `stuname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `classe` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `prizeunit` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `comment` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `uri` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `atime` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_awards`
--

LOCK TABLES `jsj_awards` WRITE;
/*!40000 ALTER TABLE `jsj_awards` DISABLE KEYS */;
INSERT INTO `jsj_awards` VALUES (1,2,2,2,2,'2','wwedad','2','2','2','2','2','201609'),(2,1,1,1,1,'1','dsasdasda','1','1','1','1','1','201504'),(3,23,3,2,3,'2','1','123','123123','3','3','2','201604'),(4,4,4,4,4,'4','4','4','4','5',NULL,NULL,'201605'),(6,3,3,3,3,'3','3','3','3','3',NULL,NULL,'201603'),(7,5,2,2,2,'2','2','2','2','2',NULL,NULL,'201602');
/*!40000 ALTER TABLE `jsj_awards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_question_paper`
--

DROP TABLE IF EXISTS `jsj_question_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_question_paper` (
  `qid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `pnum` int(11) DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `invigilation` int(11) DEFAULT NULL,
  `ab` int(11) DEFAULT NULL,
  `answer` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_question_paper`
--

LOCK TABLES `jsj_question_paper` WRITE;
/*!40000 ALTER TABLE `jsj_question_paper` DISABLE KEYS */;
INSERT INTO `jsj_question_paper` VALUES (1367,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',1,1,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1368,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1369,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1370,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1371,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1372,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1373,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',1,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1374,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1375,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1376,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1377,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1378,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1379,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1380,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1381,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1382,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1383,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1384,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1385,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1386,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1387,'jsjp06','软件1305','英语训练(A)Ⅴ',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1388,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1389,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1390,'程震','软件1405,软件1406','脚本编程技术',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1391,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1392,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',1,1,57,10,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1393,'董敬富','软件1405','计算机组成原理(B)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1394,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',1,2,88,0,0,0,1,1,1,1,1,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1395,'付秀花','通信1303,通信1304','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1396,'付秀花','通信1301,通信1302','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1397,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1398,'巩秀钢','计科1502(卓越)','物联网技术基础',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1399,'韩慧','通信1401','微机原理及应用(A)',1,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1400,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1401,'韩祥波','电科本1401,电科本1402','数据结构(A)',1,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1402,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1403,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1404,'侯庆来','数媒1502(春)','电声系统与调音技术',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1405,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1406,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1407,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',1,1,42,12,0,0,0,0,0,0,0,'                                                \r\n                                            ','2015-2016-1',NULL,'未修改'),(1408,'贾鹏','通信1404','微机原理及应用(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1409,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',1,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1410,'姜桂洪','软件1401,软件1402','软件工程(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1411,'鞠传香','软件1301,软件1302','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1412,'鞠传香','信科1301,信科1302','编译原理(B)',1,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1413,'李盘靖','测绘1502','C#语言程序开发(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1414,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1415,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1416,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',1,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1417,'李艳群','数媒1401(春)','计算机二维动画',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1418,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1419,'李增祥','2015级','计算机应用基础(A)',1,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1420,'李钊','软件1406','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1421,'林浩','软件1401,软件1402','计算机组成原理(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1422,'刘倩','通信1301,通信1302','计算机通信网（双语）',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1423,'刘秋香','测绘1501(春)','C#语言程序开发',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1424,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1425,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1426,'刘树淑','计科1401(卓越)','数据库系统原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1427,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1428,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1429,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1430,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',1,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1431,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',1,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1432,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',1,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1433,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1434,'吕昌泰','计科1401(卓越)','计算机网络(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1435,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1436,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',1,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1437,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1438,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1439,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1440,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1441,'彭荣群','通信1301,通信1302','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1442,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1443,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1444,'任崇广','农机1505(能源)','VC程序设计(A)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1445,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1446,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1447,'商鹏','软件1305','统一建模语言UML(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1448,'邵宝民','软件1401,软件1402','WEB开发基础(A)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1449,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1450,'石少俭','软件1503,软件1504','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1451,'石少俭','电科本1403','数据结构(A)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1452,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',1,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1453,'苏晶','软件1303,软件1304','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1454,'孙坤','软件1403,软件1404','WEB开发基础(A)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1455,'孙守卿','软件1303,软件1304','编译原理(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1456,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1457,'孙守卿','软件1501,软件1502','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1458,'孙文珠','通信1303,通信1304','现代交换技术(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1459,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1460,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1461,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1462,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',1,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1463,'王德亮','数媒1401(春)','网页制作',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1464,'王凤英','计科1402(卓越)','计算机网络(A)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1465,'王海鹏','软件1305','编译原理(A)',1,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1466,'王举辉','计科1403,计科1404','操作系统(B)',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1467,'王举辉','数媒1502(春)','计算机程序设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1468,'王涛','通信1403','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1469,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1470,'王云','软件1505,软件1506','离散数学(B)',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1471,'夏斌','通信1303,通信1304','移动通信(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1472,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',1,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1473,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',1,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1474,'谢楠','通信1402','微机原理及应用(A)',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1475,'谢印宝','软件1405,软件1406','操作系统(B)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1476,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',1,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1477,'徐苗','数媒1401(春)','动画技法',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1478,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',1,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1479,'徐苗','数媒1502(春)','艺术设计基础',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1480,'姚芳芳','数媒1301','影视后期合成(B)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1481,'姚芳芳','数媒1302','影视后期合成(B)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1482,'姚芳芳','数媒1401(春)','影视剪辑',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1483,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',1,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1484,'于潇','计科1404','计算机组成原理(B)',1,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1485,'于潇','计科1403','计算机组成原理(B)',1,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1486,'袁静','数媒1502(春)','平面图像处理',1,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1487,'袁静','数媒1301','三维材质与灯光技术(A)',1,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1488,'袁静','数媒1302','三维材质与灯光技术(A)',1,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1489,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1490,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',1,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1491,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',1,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1492,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',1,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1493,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1494,'张立红','通信1503','程序设计基础(B)Ⅱ',1,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1495,'张连俊','通信1401,通信1402','信号与系统(A)',1,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1496,'张连俊','通信1403,通信1404','信号与系统(A)',1,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1497,'张龙波','计科1402(卓越)','数据库系统原理(B)',1,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1498,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',1,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1499,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1500,'张艳华','计科1403,计科1404','脚本编程技术',1,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1501,'张艳华','计科1503,计科1504','离散数学(B)',1,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1502,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',1,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','已修改'),(1503,'赵晖','通信1301,通信1302','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1504,'赵晖','通信1303,通信1304','面向对象程序设计(A)',1,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1506,'赵连军','软件1403,软件1404','软件工程(B)',1,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1507,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',1,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1508,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',1,1,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','已修改'),(1509,'赵明波','计科1501(卓越)','物联网技术基础',1,1,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','已修改'),(1510,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,1,62,13,0,0,0,0,0,0,0,'1212 12                           ','2015-2016-1','计科13','已修改'),(1511,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,0,0,0,0,'                                            ','2015-2016-1','计科13','已修改'),(1512,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',1,2,62,12,0,0,0,1,1,1,1,'                                                                                                \r\n                                            \r\n                                            ','2015-2016-1','计科13','已修改'),(1513,'jsjp01','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1514,'jsjp02','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理提高',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1515,'jsjp03','软件1503','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1516,'jsjp03','软件1501','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1517,'jsjp03','软件1502','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1518,'jsjp03','软件1504','计算机软件开发实践(A)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1519,'jsjp04','软件1403','计算机软件开发实践(A)Ⅳ',2,2,45,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1520,'jsjp04','软件1401','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1521,'jsjp04','软件1402','计算机软件开发实践(A)Ⅳ',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1522,'jsjp04','软件1404','计算机软件开发实践(A)Ⅳ',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1523,'jsjp04','软件1302','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1524,'jsjp04','软件1304','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1525,'jsjp04','软件1303','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1526,'jsjp04','软件1301','计算机软件开发实践(A)Ⅵ',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1527,'jsjp04','软件1305','计算机软件开发实践(A)Ⅵ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1528,'jsjp06','软件1501,软件1502','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1529,'jsjp06','软件1503,软件1504','英语训练(A)Ⅰ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1530,'jsjp06','软件1401,软件1402','英语训练(A)Ⅲ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1531,'jsjp06','软件1403,软件1404','英语训练(A)Ⅲ',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1532,'jsjp06','软件1303,软件1304','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1533,'jsjp06','软件1305','英语训练(A)Ⅴ',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1534,'jsjp06','软件1301,软件1302','英语训练(A)Ⅴ',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1535,'曹雁峰','计科1401(卓越)','JAVA语言程序设计(C)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1536,'程震','软件1405,软件1406','脚本编程技术',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1537,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','JAVA高级编程(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1538,'崔鑫','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','Java企业级项目实训(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1539,'董敬富','软件1405','计算机组成原理(B)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1540,'方春','计科1401(中外),计科1402(中外)','离散数学(B)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1541,'付秀花','通信1303,通信1304','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1542,'付秀花','通信1301,通信1302','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1543,'巩秀钢','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式操作系统设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1544,'巩秀钢','计科1502(卓越)','物联网技术基础',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1545,'韩慧','通信1401','微机原理及应用(A)',2,2,44,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1546,'韩慧','机制中外1301,机制中外1302','微机原理及应用(B)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','机制中外13','未修改'),(1547,'韩祥波','电科本1401,电科本1402','数据结构(A)',2,2,76,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1548,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','影视鉴赏与批评(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1549,'韩振雷','数媒1301(影视制作),数媒1302(影视制作)','专题片策划与制作(A)',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1550,'侯庆来','数媒1502(春)','电声系统与调音技术',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1551,'黄晶晶','计科1401(卓越),计科1402(卓越)','操作系统(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1552,'贾茂盈','软件1403,软件1404','计算机组成原理(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1553,'贾茂盈','计科1402(卓越)','计算机组成原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1554,'贾鹏','通信1404','微机原理及应用(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1555,'贾永新','软件1301(移动开发方向)','Android初级开发(A)',2,2,6,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1556,'姜桂洪','软件1401,软件1402','软件工程(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1557,'鞠传香','软件1301,软件1302','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1558,'鞠传香','信科1301,信科1302','编译原理(B)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1559,'李盘靖','测绘1502','C#语言程序开发(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1560,'李盘靖','计科1401(中外),计科1402(中外)','移动应用程序开发',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1561,'李鑫鑫','计科1402(卓越)','JAVA语言程序设计(C)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1562,'李艳群','广告1301(广告方向),广告1302(广告方向)','动画设计(A)',2,2,4,0,0,0,0,0,0,0,0,'','2015-2016-1','广告13','未修改'),(1563,'李艳群','数媒1401(春)','计算机二维动画',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1564,'李业德','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','智能化仪器原理与设计(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1565,'李增祥','2015级','计算机应用基础(A)',2,2,200,0,0,0,0,0,0,0,0,'','2015-2016-1','','未修改'),(1566,'李钊','软件1406','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1567,'林浩','软件1401,软件1402','计算机组成原理(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1568,'刘倩','通信1301,通信1302','计算机通信网（双语）',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1569,'刘秋香','测绘1501(春)','C#语言程序开发',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','测绘15','未修改'),(1570,'刘秋香','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','统一建模语言UML(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1571,'刘树淑','计科1401(中外),计科1402(中外)','数据库系统',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1572,'刘树淑','计科1401(卓越)','数据库系统原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1573,'刘晓红','计科1507(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1574,'刘晓红','计科1505(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1575,'刘晓红','计科1506(中外)','程序设计基础(B)Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1576,'柳兆军','通信1303(信息通信技术),通信1304(信息通信技术)','单片机原理及应用(A)',2,2,33,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1577,'柳兆军','通信1301(信息通信技术),通信1302(信息通信技术)','单片机原理及应用(A)',2,2,55,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1578,'吕兵','软件1303(Java方向),软件1304(Java方向),软件1305(Java方向)','Java Web程序设计(A)',2,2,79,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1579,'吕昌泰','计科1401(中外),计科1402(中外)','计算机网络(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1580,'吕昌泰','计科1401(卓越)','计算机网络(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1581,'马新娟','软件1501,软件1502','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1582,'马新娟','通信1501,通信1502','程序设计基础(B)Ⅱ',2,2,81,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1583,'马新娟','计科1507(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1584,'马新娟','计科1506(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1585,'马新娟','计科1505(中外)','程序设计基础实践Ⅱ',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1586,'马新娟','计科1505(中外),计科1506(中外),计科1507(中外)','高级程序设计',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1587,'彭荣群','通信1301,通信1302','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1588,'齐立森','数媒1301(动画技术),数媒1302(动画技术)','动画剧本与创作(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1589,'曲志坚','计科1501(卓越),计科1502(卓越)','离散数学(B)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1590,'任崇广','农机1505(能源)','VC程序设计(A)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','农机15','未修改'),(1591,'任鲁涌','通信1301(信息通信技术),通信1302(信息通信技术),通信1303(信息通信技术),通信1304(信息通信技术)','光纤通信(A)',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1592,'商鹏','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','统一建模语言UML(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1593,'商鹏','软件1305','统一建模语言UML(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1594,'邵宝民','软件1401,软件1402','WEB开发基础(A)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1595,'邵宝民','计科1401(中外),计科1402(中外)','软件开发工程',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1596,'石少俭','软件1503,软件1504','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1597,'石少俭','电科本1403','数据结构(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','电科本14','未修改'),(1598,'苏晶','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','软件测试(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1599,'苏晶','软件1303,软件1304','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1600,'孙坤','软件1403,软件1404','WEB开发基础(A)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1601,'孙守卿','软件1303,软件1304','编译原理(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1602,'孙守卿','计科1505(中外),计科1506(中外),计科1507(中外)','计算机科学基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1603,'孙守卿','软件1501,软件1502','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1604,'孙文珠','通信1303,通信1304','现代交换技术(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1605,'孙学用','工设1501,工设1502','JAVA语言程序设计(B)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','工设15','未修改'),(1606,'孙勇','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','JAVA语言程序设计(B)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1607,'孙勇','计科1403,计科1404','JAVA语言程序设计(C)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1608,'王德亮','软件1301(Java方向),软件1302(Java方向)','Java Web程序设计(A)',2,2,63,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1609,'王德亮','数媒1401(春)','网页制作',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1610,'王凤英','计科1402(卓越)','计算机网络(A)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1611,'王海鹏','软件1305','编译原理(A)',2,2,37,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1612,'王举辉','计科1403,计科1404','操作系统(B)',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1613,'王举辉','数媒1502(春)','计算机程序设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1614,'王涛','通信1403','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1615,'王云','软件1503,软件1504','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1616,'王云','软件1505,软件1506','离散数学(B)',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1617,'夏斌','通信1303,通信1304','移动通信(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1618,'肖爱梅','信应1501,信应1502,信应1503','程序设计基础(A)',2,2,98,0,0,0,0,0,0,0,0,'','2015-2016-1','信应15','未修改'),(1619,'肖爱梅','通信1301(通信软件开发),通信1302(通信软件开发),通信1303(通信软件开发),通信1304(通信软件开发)','数据结构(A)',2,2,24,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1620,'谢楠','通信1402','微机原理及应用(A)',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1621,'谢印宝','软件1405,软件1406','操作系统(B)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1622,'徐军','软件1405,软件1406','JAVA语言程序设计(C)',2,2,84,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1623,'徐苗','数媒1401(春)','动画技法',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1624,'徐苗','数媒1301(动画技术),数媒1302(动画技术)','动画运动规律(A)',2,2,30,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1625,'徐苗','数媒1502(春)','艺术设计基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1626,'姚芳芳','数媒1301','影视后期合成(B)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1627,'姚芳芳','数媒1302','影视后期合成(B)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1628,'姚芳芳','数媒1401(春)','影视剪辑',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒14','未修改'),(1629,'姚艳芝','计科1401(卓越)','计算机组成原理(B)',2,2,41,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1630,'于潇','计科1404','计算机组成原理(B)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1631,'于潇','计科1403','计算机组成原理(B)',2,2,39,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1632,'袁静','数媒1502(春)','平面图像处理',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒15','未修改'),(1633,'袁静','数媒1301','三维材质与灯光技术(A)',2,2,35,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1634,'袁静','数媒1302','三维材质与灯光技术(A)',2,2,36,0,0,0,0,0,0,0,0,'','2015-2016-1','数媒13','未修改'),(1635,'袁文浩','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','数字图像处理(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1636,'袁玉英','通信1301(网络通信技术),通信1302(网络通信技术),通信1303(网络通信技术),通信1304(网络通信技术)','光纤通信(A)',2,2,52,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1637,'张冬梅','计科1303(卓越)(软件工程),计科1304(卓越)(软件工程)','软件测试(A)',2,2,57,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1638,'张冬梅','软件1301,软件1302','统一建模语言UML(A)',2,2,78,0,0,0,0,0,0,0,0,'','2015-2016-1','软件13','未修改'),(1639,'张立红','计科1503,计科1504','程序设计基础(B)Ⅱ',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1640,'张立红','通信1503','程序设计基础(B)Ⅱ',2,2,40,0,0,0,0,0,0,0,0,'','2015-2016-1','通信15','未修改'),(1641,'张连俊','通信1401,通信1402','信号与系统(A)',2,2,87,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1642,'张连俊','通信1403,通信1404','信号与系统(A)',2,2,85,0,0,0,0,0,0,0,0,'','2015-2016-1','通信14','未修改'),(1643,'张龙波','计科1402(卓越)','数据库系统原理(B)',2,2,42,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1644,'张先伟','软件1505,软件1506','程序设计基础(B)Ⅱ',2,2,80,0,0,0,0,0,0,0,0,'','2015-2016-1','软件15','未修改'),(1645,'张先伟','计科1501(卓越),计科1502(卓越)','程序设计基础(B)Ⅱ',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1646,'张艳华','计科1403,计科1404','脚本编程技术',2,2,77,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1647,'张艳华','计科1503,计科1504','离散数学(B)',2,2,86,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1648,'张艳华','计科1401(中外),计科1402(中外)','软件测试与检验',2,2,88,0,0,0,0,0,0,0,0,'','2015-2016-1','计科14','未修改'),(1649,'赵晖','通信1301,通信1302','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1650,'赵晖','通信1303,通信1304','面向对象程序设计(A)',2,2,83,0,0,0,0,0,0,0,0,'','2015-2016-1','通信13','未修改'),(1651,'赵金铃','信科1301,信科1302','计算机网络(A)',2,2,65,0,0,0,0,0,0,0,0,'','2015-2016-1','信科13','未修改'),(1652,'赵连军','软件1403,软件1404','软件工程(B)',2,2,89,0,0,0,0,0,0,0,0,'','2015-2016-1','软件14','未修改'),(1653,'赵明波','计科1505(中外),计科1506(中外),计科1507(中外)','计算机组成原理基础',2,2,108,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1654,'赵明波','计科1301(卓越)(嵌入式系统设计),计科1302(卓越)(嵌入式系统设计),计科1303(卓越)(嵌入式系统设计),计科1304(卓越)(嵌入式系统设计)','嵌入式软件开发(A)',2,2,38,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1655,'赵明波','计科1501(卓越)','物联网技术基础',2,2,43,0,0,0,0,0,0,0,0,'','2015-2016-1','计科15','未修改'),(1656,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','JAVA高级编程(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改'),(1657,'周雪芹','计科1301(卓越)(软件工程),计科1302(卓越)(软件工程)','Java企业级项目实训(A)',2,2,62,0,0,0,0,0,0,0,0,'','2015-2016-1','计科13','未修改');
/*!40000 ALTER TABLE `jsj_question_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_role_popedom`
--

DROP TABLE IF EXISTS `jsj_role_popedom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_role_popedom` (
  `rid` int(11) NOT NULL,
  `popedomCode` varchar(100) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_role_popedom`
--

LOCK TABLES `jsj_role_popedom` WRITE;
/*!40000 ALTER TABLE `jsj_role_popedom` DISABLE KEYS */;
INSERT INTO `jsj_role_popedom` VALUES (1,'abc'),(2,'ab'),(3,'a'),(4,'abc'),(5,'abc'),(6,'abc');
/*!40000 ALTER TABLE `jsj_role_popedom` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_systemddl`
--

DROP TABLE IF EXISTS `jsj_systemddl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_systemddl` (
  `sid` bigint(20) NOT NULL AUTO_INCREMENT,
  `keyword` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ddlCode` int(11) DEFAULT NULL,
  `ddlName` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_systemddl`
--

LOCK TABLES `jsj_systemddl` WRITE;
/*!40000 ALTER TABLE `jsj_systemddl` DISABLE KEYS */;
INSERT INTO `jsj_systemddl` VALUES (1,'role',1,'管理员'),(2,'role',2,'教学科'),(3,'role',3,'教师'),(4,'dept',1,'计算机科学与技术'),(5,'dept',2,'软件工程'),(6,'dept',3,'通信工程'),(7,'dept',4,'数字媒体技术'),(8,'dept',5,'基础部'),(9,'role',4,'学院办公室'),(10,'role',5,'系主任'),(11,'role',6,'学生科'),(12,'grade',1,'2013'),(13,'grade',2,'2014'),(14,'grade',3,'2015'),(15,'grade',4,'2016');
/*!40000 ALTER TABLE `jsj_systemddl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_training_paper`
--

DROP TABLE IF EXISTS `jsj_training_paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_training_paper` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT,
  `teacher` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `className` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `course` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `psource` int(11) DEFAULT NULL,
  `examineway` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `tnum` int(11) DEFAULT NULL,
  `nature` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `analyzes` int(11) DEFAULT NULL,
  `plan` int(11) DEFAULT NULL,
  `standard` int(11) DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `comment` varchar(300) COLLATE utf8_bin DEFAULT NULL,
  `fileNum` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  `schoolYear` varchar(100) COLLATE utf8_bin DEFAULT NULL,
  `isChange` varchar(25) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_training_paper`
--

LOCK TABLES `jsj_training_paper` WRITE;
/*!40000 ALTER TABLE `jsj_training_paper` DISABLE KEYS */;
INSERT INTO `jsj_training_paper` VALUES (1,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(3,'方春','软件1504','程序设计实训(A)',1,1,40,40,'实践',1,1,0,0,'1',NULL,NULL,'未修改'),(4,'曹阳','计科1404','JAVA项目实训',1,1,38,38,'实践',1,1,1,1,'',NULL,NULL,'未修改'),(7,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(8,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(9,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(10,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(11,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(12,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(13,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(14,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(15,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(16,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(17,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(18,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(19,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',1,1,1,1,'1',NULL,NULL,'未修改'),(20,'jsjp03','软件1301(移动开发方向)','Android初级项目实训',1,1,6,10,'实践',0,1,1,1,'1','软件13','','已修改'),(22,'1111','111','111',1,1,12,12,'实践',0,1,0,0,'','','','已修改');
/*!40000 ALTER TABLE `jsj_training_paper` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user`
--

DROP TABLE IF EXISTS `jsj_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT,
  `employeenum` varchar(20) COLLATE utf8_bin NOT NULL,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `deptid` int(11) DEFAULT NULL,
  `phone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user`
--

LOCK TABLES `jsj_user` WRITE;
/*!40000 ALTER TABLE `jsj_user` DISABLE KEYS */;
INSERT INTO `jsj_user` VALUES (1,'02533','常征','111111',3,'1111','1111111'),(3,'04260','陈波','111111',3,'1111','11112'),(4,'04113','程震','111111',3,'1','1'),(5,'03434','崔孝凤','111111',4,'2','2'),(6,'03144','崔鑫','111111',3,'4','4'),(7,'02177','董敬富','111111',1,NULL,NULL),(8,'02178','董延','111111',1,NULL,NULL),(9,'02179','范忠奇','111111',1,NULL,NULL),(10,'04718','方春','111111',1,NULL,NULL),(11,'04054','付秀花','111111',1,NULL,NULL),(12,'03436','高明玲','111111',1,NULL,NULL),(13,'02181','巩秀钢','111111',1,NULL,NULL),(14,'04452','郭莹','111111',1,NULL,NULL),(15,'04366','韩慧','111111',1,NULL,NULL),(16,'02183','韩祥波','111111',1,NULL,NULL),(17,'02541','韩振雷','111111',1,NULL,NULL),(18,'04078','黄晶晶','111111',1,NULL,NULL),(19,'03439','贾凌','111111',1,NULL,NULL),(20,'02184','贾茂盈','111111',1,NULL,NULL),(21,'02185','贾鹏','111111',1,NULL,NULL),(22,'02186','贾永新','111111',1,NULL,NULL),(23,'03156','姜桂洪','111111',1,NULL,NULL),(24,'03440','解红','111111',1,NULL,NULL),(25,'04069','鞠传香','111111',1,NULL,NULL),(26,'03441','巨同升','111111',1,NULL,NULL),(27,'03442','冷淑霞','111111',1,NULL,NULL),(28,'02188','李彩虹','111111',1,NULL,NULL),(29,'03443','李浩','111111',1,NULL,NULL),(30,'04418','李盘靖','111111',1,NULL,NULL),(31,'04748','李文婷','111111',1,NULL,NULL),(32,'04783','李鑫鑫','111111',1,NULL,NULL),(33,'03444','李艳','111111',1,NULL,NULL),(34,'01156','李艳群','111111',1,NULL,NULL),(35,'02190','李业德','111111',1,NULL,NULL),(36,'03445','李业刚','111111',1,NULL,NULL),(37,'03266','李幼蛟','111111',1,NULL,NULL),(38,'03446','李增祥','111111',1,NULL,NULL),(39,'04689','李钊','111111',1,NULL,NULL),(40,'02191','李智广','111111',1,NULL,NULL),(41,'04736','梁春燕','111111',1,NULL,NULL),(42,'02192','林浩','111111',1,NULL,NULL),(43,'04121','刘灿德','111111',1,NULL,NULL),(44,'04635','刘丛丛','111111',1,NULL,NULL),(45,'01949','刘东锋','111111',1,NULL,NULL),(46,'03447','刘冬霞','111111',1,NULL,NULL),(47,'03126','刘刚','111111',1,NULL,NULL),(48,'04294','刘倩','111111',1,NULL,NULL),(49,'04306','刘秋香','111111',1,NULL,NULL),(50,'02194','刘树淑','111111',1,NULL,NULL),(51,'03448','刘伟','111111',1,NULL,NULL),(52,'02195','刘晓红','111111',1,NULL,NULL),(53,'02196','柳兆军','111111',1,NULL,NULL),(54,'02172','鹿宏','111111',1,NULL,NULL),(55,'04477','吕兵','111111',1,NULL,NULL),(56,'03175','吕昌泰','111111',1,NULL,NULL),(57,'03449','吕承祥','111111',1,NULL,NULL),(58,'02198','马新娟','111111',1,NULL,NULL),(59,'02201','彭荣群','111111',1,NULL,NULL),(60,'04176','齐立森','111111',1,NULL,NULL),(61,'04488','曲东','111111',1,NULL,NULL),(62,'04565','曲志坚','111111',1,NULL,NULL),(63,'04688','任崇广','111111',1,NULL,NULL),(64,'02202','任鲁涌','111111',1,NULL,NULL),(65,'04300','商鹏','111111',1,NULL,NULL),(66,'04770','邵宝民','111111',1,NULL,NULL),(67,'02203','石少俭','111111',1,NULL,NULL),(68,'03451','石志伟','111111',1,NULL,NULL),(69,'03433','宋吉和','111111',1,NULL,NULL),(70,'02086','宋吉江','111111',1,NULL,NULL),(71,'04307','苏晶','111111',1,NULL,NULL),(72,'01683','孙成状','111111',1,NULL,NULL),(73,'03452','孙福振','111111',1,NULL,NULL),(74,'03190','孙坤','111111',1,NULL,NULL),(75,'04270','孙守卿','111111',1,NULL,NULL),(76,'04687','孙文珠','111111',1,NULL,NULL),(77,'02207','孙学用','111111',1,NULL,NULL),(78,'02208','孙勇','111111',1,NULL,NULL),(79,'03196','王德亮','111111',1,NULL,NULL),(80,'02209','王凤英','111111',1,NULL,NULL),(81,'04680','王海鹏','111111',1,NULL,NULL),(82,'02210','王江红','111111',1,NULL,NULL),(83,'02212','王举辉','111111',1,NULL,NULL),(84,'04697','王雷','111111',1,NULL,NULL),(85,'03456','王立香','111111',1,NULL,NULL),(86,'02214','王善斌','111111',1,NULL,NULL),(87,'04110','王绍卿','111111',1,NULL,NULL),(88,'04782','王涛','111111',1,NULL,NULL),(89,'03128','王有爱','111111',1,NULL,NULL),(90,'04208','王云','111111',1,NULL,NULL),(91,'02168','王振友','111111',1,NULL,NULL),(92,'02215','王志强','111111',1,NULL,NULL),(93,'04233','吴志勇','111111',1,NULL,NULL),(94,'04278','夏斌','111111',1,NULL,NULL),(95,'02217','肖爱梅','111111',1,NULL,NULL),(96,'04112','谢楠','111111',1,NULL,NULL),(97,'02219','谢印宝','111111',1,NULL,NULL),(98,'03302','徐军','111111',1,NULL,NULL),(99,'04177','徐苗','111111',1,NULL,NULL),(100,'03457','薛磊江','111111',1,NULL,NULL),(101,'03458','杨秀丽','111111',1,NULL,NULL),(102,'04178','姚芳芳','111111',1,NULL,NULL),(103,'02224','姚艳芝','111111',1,NULL,NULL),(104,'04474','尹晓盛','111111',1,NULL,NULL),(105,'03460','于潇','111111',1,NULL,NULL),(106,'03461','于振海','111111',1,NULL,NULL),(107,'04281','袁静','111111',1,NULL,NULL),(108,'04684','袁文浩','111111',1,NULL,NULL),(109,'04377','袁玉英','111111',1,NULL,NULL),(110,'02014','闸建文','111111',1,NULL,NULL),(111,'03462','翟正德','111111',1,NULL,NULL),(112,'04225','张冬梅','111111',1,NULL,NULL),(113,'03230','张慧','111111',1,NULL,NULL),(114,'02226','张立红','111111',1,NULL,NULL),(115,'03463','张立颖','111111',1,NULL,NULL),(116,'02228','张连俊','111111',1,NULL,NULL),(117,'02229','张龙波','111111',1,NULL,NULL),(118,'03310','张文慧','111111',1,NULL,NULL),(119,'02230','张先伟','111111',1,NULL,NULL),(120,'02572','张延贤','111111',1,NULL,NULL),(121,'02231','张衍杰','111111',1,NULL,NULL),(122,'02232','张艳华','111111',1,NULL,NULL),(123,'02233','赵光远','111111',1,NULL,NULL),(124,'04290','赵晖','111111',1,NULL,NULL),(125,'02234','赵金铃','111111',1,NULL,NULL),(126,'01166','赵磊','111111',1,'13265923329','mnzero@163.com'),(127,'04070','赵连军','111111',1,'13265923329','mnzero@163.com'),(128,'02235','赵明波','111111',1,NULL,NULL),(129,'03238','郑强','111111',1,NULL,NULL),(130,'03464','周洁','111111',1,NULL,NULL),(131,'02236','周雪芹','111111',1,'1111','1111'),(132,'666666','超级管理员','12345',1,'',''),(142,'1232312','111','000000',1,'17865923329','mnzero@163.com'),(144,'111111','撒旦撒','000000',1,'15865923329','1589330137@qq.com'),(145,'111112','sss','000000',1,'',''),(146,'123','www','000000',3,'15865923329','mnzero@163.com'),(148,'1111112','请求','000000',5,'','');
/*!40000 ALTER TABLE `jsj_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jsj_user_role`
--

DROP TABLE IF EXISTS `jsj_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jsj_user_role` (
  `uid` bigint(20) NOT NULL,
  `rid` int(11) NOT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jsj_user_role`
--

LOCK TABLES `jsj_user_role` WRITE;
/*!40000 ALTER TABLE `jsj_user_role` DISABLE KEYS */;
INSERT INTO `jsj_user_role` VALUES (1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(9,3),(10,3),(11,3),(12,3),(13,3),(14,3),(15,3),(16,3),(17,3),(18,3),(19,3),(20,3),(21,3),(22,3),(23,3),(24,3),(25,3),(26,3),(27,3),(28,3),(29,3),(30,3),(31,3),(32,3),(33,3),(34,3),(35,3),(36,3),(37,3),(38,3),(39,3),(40,3),(41,3),(42,3),(43,3),(44,3),(45,3),(46,3),(47,3),(48,3),(49,3),(50,3),(51,3),(52,3),(53,3),(54,3),(55,3),(56,3),(57,3),(58,3),(59,3),(60,3),(61,3),(62,3),(63,3),(64,3),(65,3),(66,3),(67,3),(68,3),(69,3),(70,3),(71,3),(72,3),(73,3),(74,3),(75,3),(76,3),(77,3),(78,3),(79,3),(80,3),(81,3),(82,3),(83,3),(84,3),(85,3),(86,3),(87,3),(88,3),(89,3),(90,3),(91,3),(92,3),(93,3),(94,3),(95,3),(96,3),(97,3),(98,3),(99,3),(100,3),(101,3),(102,3),(103,3),(104,3),(105,3),(106,3),(107,3),(108,3),(109,3),(110,3),(111,3),(112,3),(113,3),(114,3),(115,3),(116,3),(117,3),(118,3),(119,3),(120,3),(121,3),(122,2),(123,3),(124,3),(125,3),(126,3),(127,3),(128,3),(129,3),(130,3),(131,1),(132,1),(142,3),(144,3),(145,3),(146,3),(148,3);
/*!40000 ALTER TABLE `jsj_user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-07-24  0:25:34